app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."fb_id" = '617977441') LIMIT 1
---
  def index
    @user_ids = User.all.map(&:fb_id).sort